miniwinwm/miniwinwm/Renesas/RX65N/MiniWinFile/src/smc_gen/r_usb_basic/src/driver/r_usb_hmanager.c
/******************************************************************************
 Function Name   : usb_hstd_enumeration_err
 Description     : Output error information when enumeration error occurred.
 Argument        : uint16_t Rnum             : enumeration sequence
 Return          : none
 ******************************************************************************/
static void usb_hstd_enumeration_err (uint16_t Rnum)
{
    /* Condition compilation by the difference of useful function */
#if defined(USB_DEBUG_ON)
    switch (Rnum)
    {
        case 0: USB_PRINTF0(" Get_DeviceDescrip(8)\n"); break;
        case 1: USB_PRINTF0(" Set_Address\n"); break;
        case 2: USB_PRINTF0(" Get_DeviceDescrip(18)\n"); break;
        case 3: USB_PRINTF0(" Get_ConfigDescrip(9)\n"); break;
        case 4: USB_PRINTF0(" Get_ConfigDescrip(xx)\n"); break;
        case 5: usb_hstd_enum_function5(); break; /* Device enumeration function */
        case 6: USB_PRINTF0(" Set_Configuration\n"); break;
        default: break;
    }
#endif /* defined(USB_DEBUG_ON) */
}
/******************************************************************************
 End of function usb_hstd_enumeration_err
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_chk_device_class
 Description     : Interface class search
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure.
                 : usb_hcdreg_t *driver     : Class driver
 Return          : uint16_t                 : USB_OK / USB_ERROR
 ******************************************************************************/
static uint16_t usb_hstd_chk_device_class (usb_utr_t *ptr, usb_hcdreg_t *driver)
{
    uint8_t *descriptor_table;
    uint16_t total_length1;
    uint16_t total_length2;
    uint16_t result;
    uint16_t hub_device;
    uint16_t *table[9];
    uint16_t tmp4;
    uint16_t tmp5;
    uint16_t tmp6;
    uint16_t vendor_id;
    uint16_t product_id;
    uint16_t id_check;
    uint16_t i;

    descriptor_table = (uint8_t*) g_usb_hstd_device_descriptor[ptr->ip];

    /* Device class check */
    tmp4 = descriptor_table[USB_DEV_B_DEVICE_CLASS];
    tmp5 = descriptor_table[USB_DEV_B_DEVICE_SUBCLASS];
    tmp6 = descriptor_table[USB_DEV_B_DEVICE_PROTOCOL];
    hub_device = USB_OK;
    if (((0xFF == tmp4) && (0xFF == tmp5)) && (0xFF == tmp6))
    {
        USB_PRINTF0("*** Vendor specific device.\n\n");
    }
    else if (((USB_IFCLS_HUB == tmp4) && (0X00 == tmp5)) && (0X00 == tmp6))
    {
        USB_PRINTF0("*** Full-Speed HUB device.\n\n");
        hub_device = USB_FSHUB;
    }
    else if (((USB_IFCLS_HUB == tmp4) && (0x00 == tmp5)) && (0x01 == tmp6))
    {
        USB_PRINTF0("*** High-Speed single TT device.\n\n");
        hub_device = USB_HSHUBS;
    }
    else if (((USB_IFCLS_HUB == tmp4) && (0x00 == tmp5)) && (0x02 == tmp6))
    {
        USB_PRINTF0("*** High-Speed multiple TT device.\n\n");
        hub_device = USB_HSHUBM;
    }
    else if (((0 != tmp4) || (0 != tmp5)) || (0 != tmp6))
    {
        USB_PRINTF0("### Device class information error!\n\n");
    }
    else
    {
        /* Non */
    }

    id_check = USB_ERROR;
    for (i = 0; i < driver->p_tpl[0]; i++)
    {
        vendor_id = (uint16_t)(descriptor_table[USB_DEV_ID_VENDOR_L]
                + ((uint16_t)descriptor_table[USB_DEV_ID_VENDOR_H] << 8));
        product_id = (uint16_t)(descriptor_table[USB_DEV_ID_PRODUCT_L]
                + ((uint16_t)descriptor_table[USB_DEV_ID_PRODUCT_H] << 8));

        if ((driver->p_tpl[(i * 2) + 2] == USB_NOVENDOR) || (driver->p_tpl[(i * 2) + 2] == vendor_id))
        {

            if ((driver->p_tpl[(i * 2) + 3] == USB_NOPRODUCT) || (driver->p_tpl[(i * 2) + 3] == product_id))
            {
                id_check = USB_OK;
#if USB_CFG_COMPLIANCE == USB_CFG_ENABLE
                g_usb_disp_param[ptr->ip].status    = USB_CT_TPL;
                g_usb_disp_param[ptr->ip].pid       = product_id;
                g_usb_disp_param[ptr->ip].vid       = vendor_id;
                g_usb_disp_param_set[ptr->ip]       = USB_ON;
#endif /* USB_CFG_COMPLIANCE == USB_CFG_ENABLE */
            }
        }
    }

    if (id_check == USB_ERROR)
    {
        USB_PRINTF0("### Not support device\n");
#if USB_CFG_COMPLIANCE == USB_CFG_ENABLE
        if (descriptor_table[4] == USB_IFCLS_HUB)
        {
            g_usb_disp_param[ptr->ip].status    = USB_CT_HUB;
            g_usb_disp_param[ptr->ip].pid       = product_id;
            g_usb_disp_param[ptr->ip].vid       = vendor_id;
            g_usb_disp_param_set[ptr->ip]       = USB_ON;
        }
        else
        {
            g_usb_disp_param[ptr->ip].status = USB_CT_NOTTPL;
            g_usb_disp_param[ptr->ip].pid    = product_id;
            g_usb_disp_param[ptr->ip].vid    = vendor_id;
            g_usb_disp_param_set[ptr->ip]    = USB_ON;
        }
#endif /* USB_CFG_COMPLIANCE == USB_CFG_ENABLE */

        return USB_ERROR;
    }

    descriptor_table = (uint8_t*) g_usb_hstd_config_descriptor[ptr->ip];
    total_length1 = 0;
    total_length2 = (uint16_t) (descriptor_table[USB_DEV_W_TOTAL_LENGTH_L]
            + ((uint16_t) descriptor_table[USB_DEV_W_TOTAL_LENGTH_H] << 8));

    if (total_length2 > USB_CONFIGSIZE)
    {
        total_length2 = USB_CONFIGSIZE;
    }

    /* Search within configuration total-length */
    while (total_length1 < total_length2)
    {
        switch (descriptor_table[total_length1 + 1])
        {
            /* Configuration Descriptor ? */
            case USB_DT_CONFIGURATION :
                table[1] = (uint16_t*) &descriptor_table[total_length1];
            break;

                /* Interface Descriptor ? */
            case USB_DT_INTERFACE :
                if ((uint16_t) descriptor_table[total_length1 + 5] == driver->ifclass)
                {
                    result = USB_ERROR;
                    table[0] = (uint16_t*) &g_usb_hstd_device_descriptor[ptr->ip];
                    table[2] = (uint16_t*) &descriptor_table[total_length1];
                    table[3] = &result;
                    table[4] = &hub_device;
                    table[6] = &g_usb_hstd_device_speed[ptr->ip];
                    table[7] = &g_usb_hstd_device_addr[ptr->ip];
                    if (USB_NULL == driver->classcheck)   /* Check Callback function */
                    {
                        while(1)
                        {
                            /* Error Stop */
                        }
                    }
                    (*driver->classcheck)(ptr, (uint16_t**) &table);

                    /* Interface Class */
                    g_usb_hstd_device_info[ptr->ip][g_usb_hstd_device_addr[ptr->ip]][3] = descriptor_table[total_length1
                            + 5];
                    return result;
                }

                /*          USB_PRINTF2("*** Interface class is 0x%02x (not 0x%02x)\n", 
                 descriptor_table[total_length1 + 5], driver->ifclass);*/
            break;
            default :
            break;
        }
        total_length1 += descriptor_table[total_length1];
        if (0 == descriptor_table[total_length1])
        {
            break;
        }
    }
    return USB_ERROR;
}
/******************************************************************************
 End of function usb_hstd_chk_device_class
 ******************************************************************************/

