miniwinwm/miniwinwm/Renesas/RX65N/MiniWinFile/src/smc_gen/r_usb_basic/src/driver/r_usb_hmanager.c
/******************************************************************************
 Function Name   : usb_hstd_get_string_desc
 Description     : Set GetDescriptor
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure
                 : uint16_t     addr        : device address
                 : uint16_t     string      : descriptor index
                 : usb_cb_t     complete    : callback function
 Return value    : uint16_t                 : error info
 ******************************************************************************/
#if (BSP_CFG_RTOS_USED == 1)
uint16_t usb_hstd_get_string_desc (usb_utr_t *ptr, uint16_t addr, uint16_t string)
#else /* (BSP_CFG_RTOS_USED == 1) */
uint16_t usb_hstd_get_string_desc (usb_utr_t *ptr, uint16_t addr, uint16_t string, usb_cb_t complete)
#endif /* (BSP_CFG_RTOS_USED == 1) */
{
    uint16_t i;

    if (0 == string)
    {
        g_usb_hstd_class_request[ptr->ip][2] = (uint16_t) 0x0000;
        g_usb_hstd_class_request[ptr->ip][3] = (uint16_t) 0x0004;
    }
    else
    {
        /* Set LanguageID */
        g_usb_hstd_class_request[ptr->ip][2] = (uint16_t) (g_usb_hstd_class_data[ptr->ip][2]);
        g_usb_hstd_class_request[ptr->ip][2] |= (uint16_t) ((uint16_t) (g_usb_hstd_class_data[ptr->ip][3]) << 8);
        g_usb_hstd_class_request[ptr->ip][3] = (uint16_t) CLSDATASIZE;
    }
    g_usb_hstd_class_request[ptr->ip][0] = USB_GET_DESCRIPTOR | USB_DEV_TO_HOST | USB_STANDARD | USB_DEVICE;
    g_usb_hstd_class_request[ptr->ip][1] = (uint16_t) (USB_STRING_DESCRIPTOR + string);
    g_usb_hstd_class_request[ptr->ip][4] = addr;

    for (i = 0; i < g_usb_hstd_class_request[ptr->ip][3]; i++)
    {
        g_usb_hstd_class_data[ptr->ip][i] = (uint8_t) 0xFF;
    }
#if (BSP_CFG_RTOS_USED == 1)
    return usb_hstd_cmd_submit(ptr);
#else /* (BSP_CFG_RTOS_USED == 1) */
    return usb_hstd_cmd_submit(ptr, complete);
#endif /* (BSP_CFG_RTOS_USED == 1) */
}
/******************************************************************************
 End of function usb_hstd_get_string_desc
 ******************************************************************************/

#if USB_CFG_COMPLIANCE == USB_CFG_ENABLE
#if USB_CFG_ELECTRICAL == USB_CFG_ENABLE
/******************************************************************************
 Function Name   : usb_hstd_electrical_test_mode
 Description     : Host electrical test mode function
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure
                 : uint16_t     product_id  : Task Start Code
                 : uint16_t     port        : Port number
 Return          : none
 ******************************************************************************/
void usb_hstd_electrical_test_mode(usb_utr_t *ptr, uint16_t product_id)
{
    uint16_t brdysts;

    switch(product_id)
    {
        case 0x0101: /* Test_SE0_NAK */
            usb_hstd_test_signal(ptr, 3);
            while (1)
            {
                /* This loops infinitely until it's reset. */
            }
        break;
        case 0x0102: /* Test_J */
            usb_hstd_test_signal(ptr, 1);
            while (1)
            {
                /* This loops infinitely until it's reset. */
            }
        break;
        case 0x0103: /* Test_K */
            usb_hstd_test_signal(ptr, 2);
            while (1)
            {
                /* This loops infinitely until it's reset. */
            }
            break;
        case 0x0104: /* Test_Packet */
            usb_hstd_test_signal(ptr, 4);
            while (1)
            {
                /* This loops infinitely until it's reset. */
            }
        break;
        case 0x0105: /* Reserved */
        break;
        case 0x0106: /* HS_HOST_PORT_SUSPEND_RESUME */
            usb_cpu_delay_xms(15000); /* wait 15sec */
            usb_hstd_test_suspend(ptr);
            usb_cpu_delay_xms(15000); /* wait 15sec */
            usb_hstd_test_resume(ptr);
        break;
        case 0x0107: /* SINGLE_STEP_GET_DEV_DESC */
            usb_cpu_delay_xms(15000); /* wait 15sec */
            hw_usb_hwrite_usbreq(ptr, (USB_GET_DESCRIPTOR | USB_DEV_TO_HOST | USB_STANDARD | USB_DEVICE));
            hw_usb_hset_usbval(ptr, USB_DEV_DESCRIPTOR);
            hw_usb_hset_usbleng(ptr, 0x0012);
            hw_usb_hset_sureq(ptr);
        break;
        case 0x0108: /* SINGLE_STEP_GET_DEV_DESC_DATA */
            hw_usb_hwrite_usbreq(ptr, (USB_GET_DESCRIPTOR | USB_DEV_TO_HOST | USB_STANDARD | USB_DEVICE));
            hw_usb_hset_usbval(ptr, USB_DEV_DESCRIPTOR);
            hw_usb_hset_usbindx(ptr, 0x0000);
            hw_usb_hset_usbleng(ptr, 0x0012);
            hw_usb_hset_sureq(ptr);
            usb_cpu_delay_xms(15000); /* wait 15sec */

            usb_cstd_set_nak(ptr, USB_PIPE0);
            hw_usb_write_dcpcfg(ptr, 0);

            hw_usb_hwrite_dcpctr( ptr,USB_SQSET);                      /* debug */
            usb_hstd_do_sqtgl(ptr, (uint16_t)USB_PIPE0, USB_SQMON);      /* debug */

            hw_usb_rmw_fifosel(ptr, USB_CUSE, (USB_RCNT|USB_PIPE0), (USB_RCNT|USB_ISEL|USB_CURPIPE));
            hw_usb_set_bclr(ptr, USB_CUSE);
            usb_cstd_set_buf(ptr,USB_PIPE0);
            do
            {
                brdysts = hw_usb_read_brdysts(ptr);
            }while (!(brdysts&USB_BRDY0));
            usb_cstd_set_nak(ptr, USB_PIPE0);
            hw_usb_set_sqclr(ptr, USB_PIPE0);
            hw_usb_set_bclr(ptr, USB_CUSE);
        break;
        default:
        break;
    }
}
/******************************************************************************
 End of function usb_hstd_electrical_test_mode
 ******************************************************************************/
#endif /* USB_CFG_ELECTRICAL == USB_CFG_ENABLE */
#endif /* USB_CFG_COMPLIANCE == USB_CFG_ENABLE */

/******************************************************************************
 Function Name   : usb_hstd_mgr_task
 Description     : The host manager (MGR) task.
 Argument        : usb_vp_int_t stacd          : Task Start Code
 Return          : none
 ******************************************************************************/
void usb_hstd_mgr_task (usb_vp_int_t stacd)
{
    usb_utr_t *mess, *ptr;
    usb_er_t err;
    usb_hcdreg_t *driver;
    usb_hcdinfo_t *hp;
    uint16_t rootport, devaddr, pipenum, msginfo;       
    uint16_t md;
    uint16_t enume_mode; /* Enumeration mode (device state) */
    uint16_t connect_speed;
    usb_ctrl_t ctrl;
#if (BSP_CFG_RTOS_USED == 0)
    uint16_t    devsel;
#endif /* (BSP_CFG_RTOS_USED == 0) */
#if USB_CFG_COMPLIANCE == USB_CFG_ENABLE
    usb_compliance_t disp_param;
#endif /* USB_CFG_COMPLIANCE == USB_CFG_ENABLE */

#if (BSP_CFG_RTOS_USED == 1)
    while(1)
    {
#endif /* (BSP_CFG_RTOS_USED == 1) */
    /* Receive message */
    err = USB_TRCV_MSG(USB_MGR_MBX, (usb_msg_t** )&mess, (usb_tm_t )10000);
    if (USB_OK != err)
    {
#if (BSP_CFG_RTOS_USED == 1)
        continue;
#else /* (BSP_CFG_RTOS_USED == 1) */
        return;
#endif /* (BSP_CFG_RTOS_USED == 1) */
    }
    else
    {
        p_usb_shstd_mgr_msg[mess->ip] = (usb_mgrinfo_t*) mess;
        rootport = p_usb_shstd_mgr_msg[mess->ip]->keyword;
        devaddr = p_usb_shstd_mgr_msg[mess->ip]->keyword;
        pipenum = p_usb_shstd_mgr_msg[mess->ip]->keyword;
#if (BSP_CFG_RTOS_USED == 0)
        devsel = (uint16_t) (devaddr << USB_DEVADDRBIT);
#endif /* (BSP_CFG_RTOS_USED == 1) */
        hp = (usb_hcdinfo_t*) mess;
        ptr = mess;

